app/views/posts/show.html.erb

SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 37]]
---
  <h3>Post subs</h3>
  <% @post.subs.each do |sub| %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 204]]
---
<div class="post_comments">
  <% @post.comments.each.with_index do |comment, i| %>