app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "this is a test!\r\n"], ["author_id", 1], ["post_id", 8], ["created_at", "2015-03-15 00:30:29.408570"], ["updated_at", "2015-03-15 00:30:29.408570"]]