app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs"
---
  def new
    @subs = Sub.all

SELECT "subs".* FROM "subs"
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "meow"], ["url", ""], ["content", "lol dogs"], ["sub_id", 3], ["author_id", 3], ["created_at", "2015-03-13 22:38:26.975554"], ["updated_at", "2015-03-13 22:38:26.975554"]]
---
  def create
    @post = Post.new(post_params)
    @subs = Sub.all

    if @post.save

SELECT "subs".* FROM "subs"
---
  def edit
    @subs = Sub.all

UPDATE "posts" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["url", "www.cats.com"], ["content", "they r so stupid"], ["updated_at", "2015-03-13 22:14:03.661742"], ["id", 1]]
---
  def update
    if @post.update(post_params)