app/controllers/subs_controller.rb

SELECT "subs".* FROM "subs"
---
  def index
    render json: Sub.all

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT 1  [["id", 11]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "WOOO"], ["updated_at", "2015-03-14 21:22:29.421603"], ["id", 11]]
---
  def update
    @sub = Sub.find(params[:id])

    if @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    render json: Sub.find(params[:id])